---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantMoveFrozenInstance
source: html/88b1f0db-86ac-e2a1-496d-8b7cfbc44396.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantMoveFrozenInstance Property

A family instance placed on a curved surface of a linked file can't be moved while the link is unloaded. To move the instance, reload the link or rehost the instance.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantMoveFrozenInstance { get; }
```